[Survived] StringLiteral
src/BookingQuery.ts:19:30
 }
 
 export const ROOM_ONE_NAME = 'Room 1';
-export const ROOM_TWO_NAME = 'Room 2';
+export const ROOM_TWO_NAME = "";
 export const ROOM_THREE_NAME = 'Room 3';
 

[Killed] BooleanLiteral
src/BookingQuery.ts:43:24
             end: departure
           },
           {
-            inclusive: true
+            inclusive: false
           }
         );
killedBy: List free rooms use case Booked room filter rules exclude overlapping dates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

@@ -1,7 +1,10 @@
  Array [
    Object {

[Killed] MethodExpression
src/BookingQuery.ts:51:31
       })
       .map(booking => booking?.roomName);
 
-    const freeRooms: Room[] = ALL_ROOM_NAMES
-      .filter(name => !bookedRoomNames.includes(name))
+    const freeRooms: Room[] = ALL_ROOM_NAMES
       .map(name => ({
         name
killedBy: List free rooms use case Key scenarios list only free rooms in the given period
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 6

  Array [
    Object {
+     "name": "Room 1",

[Killed] ArrowFunction
src/BookingQuery.ts:52:15
       .map(booking => booking?.roomName);
 
     const freeRooms: Room[] = ALL_ROOM_NAMES
-      .filter(name => !bookedRoomNames.includes(name))
+      .filter(() => undefined)
       .map(name => ({
         name
killedBy: List free rooms use case Key scenarios list only free rooms in the given period
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   Object {
-     "name": "Room 3",

[Killed] BooleanLiteral
src/BookingQuery.ts:52:23
       .map(booking => booking?.roomName);
 
     const freeRooms: Room[] = ALL_ROOM_NAMES
-      .filter(name => !bookedRoomNames.includes(name))
+      .filter(name => bookedRoomNames.includes(name))
       .map(name => ({
         name
killedBy: List free rooms use case Key scenarios list only free rooms in the given period
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 4

  Array [
    Object {
-     "name": "Room 3",
