[Survived] MethodExpression
src/BookingQuery.ts:31:29
   async freeRooms(arrival: Date, departure: Date): Promise<Room[]> {
     const bookings = await this.registry.getAll();
 
-    const bookedRoomNames = bookings
-      .map(booking => {
-        const isRoomUnavailable = areIntervalsOverlapping(
-          {
-            start: booking.arrivalDate,
-            end: booking.departureDate
-          },
-          {
-            start: arrival,
-            end: departure
-          },
-          {
-            inclusive: true
-          }
-        );
-
-        return isRoomUnavailable ? booking : null;
-      })
-      .filter(Boolean)
+    const bookedRoomNames = bookings.map(booking => {
+  const isRoomUnavailable = areIntervalsOverlapping({
+    start: booking.arrivalDate,
+    end: booking.departureDate
+  }, {
+    start: arrival,
+    end: departure
+  }, {
+    inclusive: true
+  });
+  return isRoomUnavailable ? booking : null;
+})
       .map(booking => booking?.roomName);
 
